# ApiDelayedUpdateFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DocumentFailures..::..ApiDelayedUpdateFailed Property
BuiltInFailures..::..DocumentFailures Class See Also
---
Delayed Updating Failed. Please contact the 3rd Party Application vendor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ApiDelayedUpdateFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ApiDelayedUpdateFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ApiDelayedUpdateFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DocumentFailures Class
Autodesk.Revit.DB Namespace